In [30]:
data = pd.read_csv(r'C:\Users\Achilles\Titanic\Data\test.csv')
data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [31]:
data['Age'] = data['Age'].fillna(data['Age'].median())

In [32]:
data['Embarked'] = data['Embarked'].fillna(data['Embarked'].mode()[0])

In [33]:
data['Fare'] = data['Fare'].fillna(data['Fare'].median())

In [34]:
data = data.drop_duplicates(keep='first')

In [35]:
data['Sex'].replace({'male':1,'female':0},inplace=True) #'male':1,'female':0

In [36]:
data['Embarked'].replace({'S':1,'C':2,'Q':3},inplace=True)  #'S':1,'C':2,'Q':3

In [37]:
data['FamilySize'] = data['SibSp'] + data['Parch'] + 1

In [38]:
data['Title'] = data['Name'].str.extract('[A-Za-z,\s]*\s([A-Za-z]*).\s[A-Za-z\s]*')

In [39]:
data['Title'] = data['Title'].apply(lambda x: x if x in ('Mr','Miss','Mrs','Master','Dr','Rev') else 'Rare')

In [40]:
data['Title'].replace({'Mr':0,'Miss':1,'Mrs':2,'Master':3,'Dr':4,'Rev':5,'Rare':6},inplace=True)

In [41]:
data.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)

In [42]:
data['Fare'] = pd.qcut(data['Fare'],5,labels=(1,2,3,4,5))

In [43]:
data['Age'] = pd.cut(data['Age'].astype(int),5,labels=(1,2,3,4,5))

In [46]:
data.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,FamilySize,Title
0,892,3,1,3,0,0,2,3,1,0
1,893,3,0,4,1,0,1,1,2,2
2,894,2,1,5,0,0,2,3,1,0
3,895,3,1,2,0,0,2,1,1,0
4,896,3,0,2,1,1,3,1,3,2

In [47]:
data.isna().any(axis=0)

PassengerId    False
Pclass         False
Sex            False
Age            False
SibSp          False
Parch          False
Fare           False
Embarked       False
FamilySize     False
Title          False
dtype: bool